Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.h
extern void TIMER_B_enableInterrupt(uint16_t baseAddress);

extern void TIMER_B_disableInterrupt(uint16_t baseAddress);

extern uint32_t TIMER_B_getInterruptStatus(uint16_t baseAddress);

extern void TIMER_B_enableCaptureCompareInterrupt(uint16_t baseAddress,
                                                  uint16_t captureCompareRegister);

extern void TIMER_B_disableCaptureCompareInterrupt(uint16_t baseAddress,
                                                   uint16_t captureCompareRegister);

extern uint32_t TIMER_B_getCaptureCompareInterruptStatus(uint16_t baseAddress,
                                                         uint16_t captureCompareRegister,
                                                         uint16_t mask);

extern void TIMER_B_clear(uint16_t baseAddress);

extern uint8_t TIMER_B_getSynchronizedCaptureCompareInput(uint16_t baseAddress,
                                                          uint16_t captureCompareRegister,
                                                          uint16_t synchronized);

extern uint8_t TIMER_B_getOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                                         uint16_t captureCompareRegister);

extern uint16_t TIMER_B_getCaptureCompareCount(uint16_t baseAddress,
                                               uint16_t captureCompareRegister);

extern void TIMER_B_setOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                                      uint16_t captureCompareRegister,
                                                      uint8_t outputModeOutBitValue);

extern void TIMER_B_outputPWM(uint16_t baseAddress,
                              TIMER_B_outputPWMParam *param);

extern void TIMER_B_stop(uint16_t baseAddress);

extern void TIMER_B_setCompareValue(uint16_t baseAddress,
                                    uint16_t compareRegister,
                                    uint16_t compareValue);

extern void TIMER_B_clearTimerInterruptFlag(uint16_t baseAddress);

extern void TIMER_B_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                                     uint16_t captureCompareRegister);

extern void TIMER_B_selectCounterLength(uint16_t baseAddress,
                                        uint16_t counterLength);

extern void TIMER_B_selectLatchingGroup(uint16_t baseAddress,
                                        uint16_t groupLatch);

extern void TIMER_B_initCompareLatchLoadEvent(uint16_t baseAddress,
                                              uint16_t compareRegister,
                                              uint16_t compareLatchLoadEvent);

extern uint16_t TIMER_B_getCounterValue(uint16_t baseAddress);

//*****************************************************************************
//
// The following are deprecated APIs.
//
//*****************************************************************************
extern void TIMER_B_configureContinuousMode(uint16_t baseAddress,
                                            uint16_t clockSource,
                                            uint16_t clockSourceDivider,
                                            uint16_t timerInterruptEnable_TBIE,
                                            uint16_t timerClear);

extern void TIMER_B_configureUpMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TBIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);

extern void TIMER_B_configureUpDownMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerPeriod,
                                        uint16_t timerInterruptEnable_TBIE,
                                        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                        uint16_t timerClear);

extern void TIMER_B_startContinuousMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerInterruptEnable_TBIE,
                                        uint16_t timerClear);

extern void TIMER_B_startContinousMode(uint16_t baseAddress,
                                       uint16_t clockSource,
                                       uint16_t clockSourceDivider,
                                       uint16_t timerInterruptEnable_TBIE,
                                       uint16_t timerClear);

extern void TIMER_B_startUpMode(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t timerInterruptEnable_TBIE,
                                uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                uint16_t timerClear);

extern void TIMER_B_startUpDownMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TBIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);

extern void TIMER_B_initCapture(uint16_t baseAddress,
                                uint16_t captureRegister,
                                uint16_t captureMode,
                                uint16_t captureInputSelect,
                                uint16_t synchronizeCaptureSource,
                                uint16_t captureInterruptEnable,
                                uint16_t captureOutputMode);

extern void TIMER_B_initCompare(uint16_t baseAddress,
                                uint16_t compareRegister,
                                uint16_t compareInterruptEnable,
                                uint16_t compareOutputMode,
                                uint16_t compareValue);

extern void TIMER_B_generatePWM(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t compareRegister,
                                uint16_t compareOutputMode,
                                uint16_t dutyCycle);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_TIMER_B_H__
